БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonForms/CW_ЖурналГрузоперевозок_РедактированияРеквизита/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Заголовок = Параметры.Заголовок;   
	ИмяРеквизита = Параметры.ИмяРеквизита;
	
	ИспользованиеСхемыПеревыставленияПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	Параметры.Свойство("ВключитьОтборПоКонтрольнойДате", ВключитьОтборПоКонтрольнойДате); 
	
	ИмяСправочника = "";
	Если НЕ Параметры.Свойство("ИмяСправочника", ИмяСправочника) Тогда 
		ИмяСправочника = "CW_Грузоперевозки";
	КонецЕсли;
	
	НадписьСверху = "";
	Если НЕ Параметры.Свойство("НадписьСверху", НадписьСверху) Тогда 
		Элементы.НадписьСверху.Видимость = Ложь;
	Иначе 
		Элементы.НадписьСверху.Заголовок = НадписьСверху;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗаголовокГруппыРаспределениеСуммы") Тогда
		Элементы.ГруппаРаспределениеСуммы.Заголовок = Параметры.ЗаголовокГруппыРаспределениеСуммы;
	КонецЕсли;
	
	// управление видимостью дополнительных опций для редактирования параметра
	#Область УправлениеВидимостьюДополнительныхПараметров 
	
	// цена с НДС
	ВыбиратьЦенаСНДС = Ложь;
	Если НЕ Параметры.Свойство("ВыбиратьЦенаСНДС", ВыбиратьЦенаСНДС) Тогда 
		ВыбиратьЦенаСНДС = Ложь;
	КонецЕсли;
	Элементы.ЦенаСНДС.Видимость = ВыбиратьЦенаСНДС; 
	
	// учитать НДС в себесмости
	ВыбиратьУчитыватьНДСВСебестоимости = Ложь;
	Если НЕ Параметры.Свойство("ВыбиратьУчитыватьНДСВСебестоимости", ВыбиратьУчитыватьНДСВСебестоимости) Тогда 
		ВыбиратьУчитыватьНДСВСебестоимости = Ложь;
	КонецЕсли;
	Элементы.УчитыватьНДСВСебестоимости.Видимость = ВыбиратьУчитыватьНДСВСебестоимости; 

	// вариант распределения суммы и НДС
	ВыбиратьВариантОтнесенияСуммы = Ложь;
	Если НЕ Параметры.Свойство("ВыбиратьВариантОтнесенияСуммы", ВыбиратьВариантОтнесенияСуммы) Тогда 
		ВыбиратьВариантОтнесенияСуммы = Ложь;
	КонецЕсли;
	
	Элементы.ВыборВарианта.Видимость 			= ВыбиратьВариантОтнесенияСуммы;
	Элементы.ВариантРаспределенияНДС.Видимость 	= ВыбиратьВариантОтнесенияСуммы;
	
	мдРеквизит = Метаданные.Справочники[ИмяСправочника].Реквизиты.Найти(ИмяРеквизита);
	Если Неопределено = мдРеквизит Тогда 
		ВызватьИсключение "В справочнике "+ИмяСправочника+" нет реквизита "+ИмяРеквизита;
		Возврат;
	КонецЕсли;                                           
	
	#КонецОбласти // УправлениеВидимостьюДополнительныхПараметров  
	
	ОписаниеТиповРеквизита = мдРеквизит.Тип;
	Тип = ОписаниеТиповРеквизита.Типы()[0];
	
	Если Перечисления.ТипВсеСсылки().СодержитТип(Тип) Тогда 
		Элементы.ПолеРедактирования.СписокВыбора.Очистить(); // для перечислений список выбора будет заполнен автоматически
	КонецЕсли;	
	
	
	Если Тип = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияЗатрат") Тогда
		
		Элементы.ПолеРедактирования.КнопкаОчистки 			= Ложь;
		Элементы.ПолеРедактирования.КнопкаВыбора 			= Ложь;
		Элементы.ПолеРедактирования.КнопкаВыпадающегоСписка = Истина;
		Элементы.ПолеРедактирования.РежимВыбораИзСписка 	= Истина;
		
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Перевыставление);
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.Затраты);
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам);
		КонецЕсли;
		
	ИначеЕсли Тип = Тип("ПеречислениеСсылка.CW_ПорядокОтраженияДоходов") Тогда 
		
		Элементы.ПолеРедактирования.КнопкаОчистки 			= Ложь;
		Элементы.ПолеРедактирования.КнопкаВыбора 			= Ложь;
		Элементы.ПолеРедактирования.КнопкаВыпадающегоСписка = Истина;
		Элементы.ПолеРедактирования.РежимВыбораИзСписка 	= Истина;
		
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.Перевыставление) ;
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.СобственнаяУслуга);
		Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПрочиеДоходы);
		
		Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
			Элементы.ПолеРедактирования.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
		КонецЕсли;

	КонецЕсли; 
	
	Элементы.ПолеРедактирования.ВыбиратьТип = Ложь;
	Элементы.ПолеРедактирования.ОграничениеТипа = ОписаниеТиповРеквизита;
	
	АдрПараметров = ПоместитьВоВременноеХранилище(Новый Структура("масГП", Параметры.МассивСсылок), ЭтаФорма.УникальныйИдентификатор);
	
	масс = Параметры.МассивСсылок;
	Делитель = ?(масс.Количество()=0, 1, масс.Количество());
	флНетПустыхЗначений = Истина;   
	СписокВыбора = Новый СписокЗначений;
	Для Каждого спрСсылка из масс Цикл
		ЗначениеРеквизита = спрСсылка[ИмяРеквизита];
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда 
			Если Неопределено = СписокВыбора.НайтиПоЗначению(ЗначениеРеквизита) Тогда 
				СписокВыбора.Добавить(ЗначениеРеквизита);
			КонецЕсли;
		Иначе 
			флНетПустыхЗначений = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если Элементы.ПолеРедактирования.СписокВыбора.Количество()>0 Тогда 
		Элементы.ПолеРедактирования.КнопкаСпискаВыбора = Истина;
	КонецЕсли;
	
	// только если в переданном массиве все значения были одинаковы и не пустые, ставим начальное значение редактирования
	Если флНетПустыхЗначений И СписокВыбора.Количество()=1 Тогда 
		
		//в списке выбора ровно один элемент и пустых не было
		ЗначениеРедактирования = СписокВыбора.Получить(0).Значение; 
		
		Если ВыбиратьЦенаСНДС Тогда
			ЦенаСНДС = масс.Получить(0).ЦенаСНДС;
		КонецЕсли;  
		
		Если ВыбиратьУчитыватьНДСВСебестоимости Тогда
			УчитыватьНДСВСебестоимости = масс.Получить(0).УчитыватьНДСВСебестоимости;
		КонецЕсли;  
		
	КонецЕсли;
	
	// чтобы не возникало значения Неопределено, а то будем путать с "отменой"
	Элементы.ПолеРедактирования.ОграничениеТипа.ПривестиЗначение(ЗначениеРедактирования);
	
	Если ТипЗнч(ЗначениеРедактирования) = Тип("СправочникСсылка.CW_МаршрутыГрузоперевозок") Тогда
		Элементы.ПолеРедактирования.РедактированиеТекста = Ложь;
		Элементы.ПолеРедактирования.БыстрыйВыбор = Ложь;
		Элементы.ПолеРедактирования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		Элементы.ПолеРедактирования.КнопкаВыбора = Истина;
		Элементы.ПолеРедактирования.ОтображениеКнопкиВыбора = ОтображениеКнопкиВыбора.ОтображатьВПолеВвода;
		Элементы.ПолеРедактирования.КнопкаВыпадающегоСписка = Ложь;		
	КонецЕсли;	
	
	Если Тип=Тип("Строка") Тогда 
		Если СтрЧислоСтрок(ЗначениеРедактирования) > 1 
			ИЛИ мдРеквизит.МногострочныйРежим
		Тогда 
			Элементы.ПолеРедактирования.МногострочныйРежим = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(ИмяФормыВыбораКОткрытию) Тогда 
		Отказ = Истина;
	КонецЕсли;
	
	//ПолеРедактированияПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	ЗначениеДелителя = ?(ВыбиратьВариантОтнесенияСуммы И (ЗначениеВыбораВарианта = 1),Делитель,1);   
	
	СтруктураПараметров = Новый Структура("Значение, Делитель, ВариантРаспределенияНДС,ЦенаСНДС,УчитыватьНДСВСебестоимости",
										  ЗначениеРедактирования, ЗначениеДелителя, ВариантРаспределенияНДС,ЦенаСНДС,УчитыватьНДСВСебестоимости);    
	
	ЭтаФорма.Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеРедактированияПриИзменении(Элемент)
	Если ВыбиратьВариантОтнесенияСуммы Тогда 
		рез = ЗначениеРедактирования / Делитель;
		стр = "на все грузоперевозки (по "+Формат(рез,"ЧДЦ=2; ЧН=")+" на каждую из "+Делитель+")";
		Элементы.ВыборВарианта.СписокВыбора[1].Представление = стр;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолеРедактированияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(ЗначениеРедактирования) = Тип("СправочникСсылка.CW_МаршрутыГрузоперевозок") Тогда
		СтандартнаяОбработка = Ложь;         
		СтруктОтбора = ПолучитьСтруктуруОтбора();
		ОткрытьФорму("Справочник.CW_МаршрутыГрузоперевозок.ФормаВыбора",СтруктОтбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	ИначеЕсли   ТипЗнч(ЗначениеРедактирования) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		
		Если  ВключитьОтборПоКонтрольнойДате Тогда
			СтандартнаяОбработка 	= Ложь;         
			ПараметрыОтбора 		= Новый Структура("ЭтоКонтрольнаяДата", Истина);
			ПараметрыФормыВыбора 	= новый Структура("Отбор",ПараметрыОтбора);
			
			ОткрытьФорму("ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок.ФормаВыбора",ПараметрыФормыВыбора, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруОтбора()
	
	Пар = ПолучитьИзвременногоХранилища(АдрПараметров);
	спТП = Новый СписокЗначений;
	Для Каждого Стр из Пар.масГП Цикл
		спТП.Добавить(Стр.ТипПеревозки);
	КонецЦикла;	
	
	Отбор = Новый Структура("ТекущийТипПеревозки,РежимВыбора", спТП, Истина);
	
	Возврат Отбор;
	
КонецФункции
